# RebarMaximSuffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarMaximSuffix Property
ParameterTypeId Class See Also
---
"Maxim Suffix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarMaximSuffix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarMaximSuffix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarMaximSuffix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace